Repository: pypi-data/pypi-mirror-80
Catalog: packages/plone.app.tiles/plone.app.tiles-3.2.1-py2.py3-none-any.whl/plone/app/tiles/locales/*/LC_MESSAGES/plone.po
Languages: it

source: Add ${name}
it: Aggiungi ${name}

source: Cancel
it: Annulla

source: Delete
it: Cancella

source: Edit
it: Modifica

source: Edit ${name}
it: Modifica ${name}

source: Remove
it: Rimuovi

source: Save
it: Salva

source: Tile created at ${url}
it: Tile creato in ${url}

source: Tile saved
it: Tile salvato

source: You must select the type of tile to create
it: Devi selezionare un tipo di tile da creare

source: description_add_new_tile
it: Seleziona un tipo di tile da creare

source: heading_add_new_tile
it: Crea un tile

source: heading_delete_tile
it: Tile esistenti

source: label_create
it: Crea

source: label_tile_type
it: Tipi di tile

source: message_body_deleted
it: I dati del tile sono stati cancellati

source: message_info
it: Info
