Repository: pypi-data/pypi-mirror-80
Catalog: packages/django-spirit/django-spirit-0.11.0.tar.gz/django-spirit-0.11.0/spirit/user/locale/*/LC_MESSAGES/django.po
Languages: it

source: The email is taken.
it: L'email è gia' in uso.

source: The provided password is incorrect.
it: La password fornita non è corretta.

source: Current time is: %(date)s %(time)s
it: L'ora attuale è: %(date)s %(time)s

source: profile
it: profilo

source: location
it: posizione

source: last seen
it: visto l'ultima volta

source: last ip
it: ultimo ip

source: time zone
it: fuso orario

source: administrator status
it: stato di amministratore

source: moderator status
it: status di moderatore

source: verified
it: verificato

source: Designates whether the user has verified his account by email or by other means. Un-select this to let the user activate his account.
it: Indica se l'utente ha verificato il suo account con e-mail o altri mezzi. De-seleziona questa opzione per consentire all'utente di attivare il suo account.

source: topic count
it: numero di topics

source: comment count
it: numero di commenti

source: forum profile
it: profilo del forum

source: forum profiles
it: profili del forum

source: Joined at
it: Unito il

source: Seen
it: Visto

source: Last IP
it: Ultimo IP

source: Preferences
it: Preferenze

source: Private Message
it: Messaggio Privato

source: Edit user
it: Modifica utente

source: Comments
it: Commenti

source: Topics
it: Argomenti

source: Likes
it: Mi-piace

source: There are no comments here, yet
it: Non ci sono commenti

source: You're receiving this email because you registered at %(site_name)s.
it: Stai ricevendo questa e-mail poiché sei registrato a %(site_name)s.

source: Please go to the following link to activate your account:
it: Si prega di visitare il seguente link per attivare il tuo account:

source: Thanks for using our site!
it: Grazie per l'utilizzo del nostro sito!

source: You're receiving this because you changed your user email at %(site_name)s.
it: Ricevi questa perché hai cambiato la tua e-mail su %(site_name)s.

source: Please go to the following link to confirm your email change:
it: Si prega di visitare il seguente link per confermare la modifica alla tua e-mail:

source: User menu
it: Menu utente

source: Profile
it: Profilo

source: Unread topics
it: Topics non letti

source: Private topics
it: Topics privati

source: You have a new notification at %(site_name)s.
it: Hai nuove notifiche su %(site_name)s.

source: Please go to the following link to read the comment:
it: Visita il seguente link per leggere il commento:

source: If you don't want to keep receiving notifications, you can deactivate them on your profile preferences.
it: Se non desideri continuare a ricevere le notifiche, è possibile disattivarle sul tuo profilo.

source: comments
it: commenti

source: Email change
it: Cambia Email

source: Change my email
it: Cambia la mia e-mail

source: likes
it: mi-piace

source: Password change
it: Modifi Password

source: Change my password
it: Cambia la mia password

source: Change password
it: Cambia password

source: Change avatar
it: Cambiare avatar

source: Go to gravatar.com and use your current email to change it
it: Vai a gravatar.com e utilizzare la tua email per cambiarlo

source: Save
it: Salva

source: User activation
it: Attivazione utente

source: New notification: %(topic_name)s
it: Nuova notifica: %(topic_name)s

source: Your profile has been updated!
it: Il tuo profilo è stato aggiornato!

source: Your password has been changed!
it: La tua password è stata cambiata!

source: We have sent you an email so you can confirm the change!
it: Abbiamo inviato una e-mail in modo da poter confermare il cambiamento!

source: Your email has been changed!
it: La tua mail è stata cambiata!

source: Sorry, we were not able to change your email.
it: Ci dispiace, non siamo stati in grado di cambiare la tua e-mail.
