Repository: pypi-data/pypi-mirror-80
Catalog: packages/kiwi-gtk/kiwi-gtk-3.0.4.tar.gz/kiwi-gtk-3.0.4/po/*.po
Languages: ar

source: Currency
ar: عملة

source: %s can not be converted to a currency
ar: %s لا يمكن تحويله إلي العملة

source: Integer
ar: عدد صحيح

source: %s could not be converted to an integer
ar: %s لا يمكن تحويله إلي عدد صحيح

source: Boolean
ar: منطقي

source: '%s' can not be converted to a boolean
ar: '%s' لا يمكن تحويله إلي منطقي

source: Float
ar: تعويم

source: This field requires a number, not %r
ar: هذا الحقل يحتاج إلي رقم، وليس%r

source: Decimal
ar: عدد عشري

source: You cannot enter a year before 1900
ar: لا يمكنك إدخال عام قبل العام 1900

source: This field requires a date of the format "%s" and not "%s"
ar: هذا الحقل يحتاج صيغة تاريخ كـ "%s" و ليست كـ "%s"

source: Time
ar: الوقت

source: Date and Time
ar: التاريخ والوقت

source: Date
ar: التاريخ

source: Object
ar: العنصر

source: Enum
ar: تعداد

source: _Today
ar: _اليوم

source: _Cancel
ar: _إلغاء

source: _Select
ar: _حدد

source: Show more _details
ar: أظهر تفاصيل _أكثر

source: Select file
ar: حدد الملف

source: Select folder
ar: حدد المجلد

source: Could not select folder "%s"
ar: لا يمكن تحديد المجلد "%s"

source: The folder "%s" could not be selected. Permission denied.
ar: المجلد"%s" لا يمكن تحديدة. الإذن مرفوض.

source: A file named "%s" already exists
ar: ملف أسمه"%s"موجود فى الاصل

source: Do you wish to replace it with the current one?
ar: هل تود أن تستبدله بالحالي؟

source: Replace
ar: أستبدل

source: Save
ar: أحفظ

source: Password:
ar: كلمة السر:

source: Add a %s
ar: أضف %s

source: Edit the selected %s
ar: عدل المحدد %s

source: Delete the selected %s
ar: امسح المحدد %s

source: Do you want to remove %s ?
ar: هل تريد أن تمسح %s ؟

source: No items to select...
ar: لا أشياء لتحديدها...

source: Total:
ar: المجموع:

source: Could not load image: %s
ar: لا يمكن تحميل الصورة: %s

source: '%s' is not a valid value for this field
ar: '%s' ليس قيمة سليمة لهذا المجال

source: This field is mandatory
ar: هذا الحقل إلزامي

source: '%s' is not a valid object
ar: '%s' ليس عنصر سليم
