Repository: pypi-data/pypi-mirror-80
Catalog: packages/tgapp-resetpassword/tgapp-resetpassword-0.2.6.tar.gz/tgapp-resetpassword-0.2.6/resetpassword/i18n/*/LC_MESSAGES/resetpassword.po
Languages: it

source: We've received a request to reset the password for this account. Please click this link to reset your password: %(password_reset_link)s If you no longer wish to make the above change, or if you did not initiate this request, please disregard and/or delete this e-mail.
it: Abbiamo ricevuto una richiesta di cambio password per il tuo account. Segui questo link per procedere con il reset della password: %(password_reset_link)s Se non desideri cambiare password o non hai effettuato tu la richiesta ignora quest email.

source: Password reset request
it: Richiesta cambio password

source: Password reset request sent
it: Richiesta di cambio password inviata

source: Invalid password reset request
it: La richiesta di cambio password non è valida

source: Password reset request timed out
it: La richiesta di cambio password è scaduta

source: Password changed successfully
it: La password è stata cambiata con successo

source: New password
it: Nuova Password

source: Confirm new password
it: Conferma nuova password

source: Save new password
it: Salva nuova password

source: Email address
it: Indirizzo Email

source: Send Request
it: Invia Richiesta

source: Change Password
it: Cambia Password

source: Request Password Reset
it: Richiedi Cambio Password
